Revit 2026 API

# DividedSurfaceHostReference Property

---

A reference to the divided face on the host.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Reference HostReference { get; }
```
```vb
Public ReadOnly Property HostReference As Reference
	Get
```
```cpp
public:
property Reference^ HostReference {
	Reference^ get ();
}
```
```fsharp
member HostReference : Reference with get
```

#### Property Value

Reference

This is the same as the hostReference argument to the NewDividedSurface method of FamilyItemFactory.

#### Reference

DividedSurface Class

Autodesk.Revit.DB Namespace